/* eslint-disable */
// 热门关键词
export const HOTWORDS_URL = {
  "hotWords": ["农家小寡妇", "情挑娇妻：偏执老公太坏了", "花锦良缘", "据说我是王的女儿", "权少溺爱：娇妻带球跑", "神医废柴妃：鬼王，别缠我", "第一狂妃", "复仇少爷小甜妻", "废柴逆天召唤师", "小妻吻上瘾", "完美至尊", "千亿盛宠：闪婚老公超能干", "一纸成婚：顾少宠妻成瘾", "凌霄之上", "仙帝归来", "一品嫡女", "重生八零：军嫂有点辣", "傲娇鬼王爱上我", "我的绝色总裁未婚妻", "天赋武神", "霸道老公放肆爱", "闪婚蜜爱：慕少的心尖萌妻", "绝品败家系统", "少帅你老婆又跑了"],
  "newHotWords": [{
    "word": "农家小寡妇",
  }, {
    "word": "情挑娇妻：偏执老公太坏了",
  }, {
    "word": "花锦良缘",
  }, {
    "word": "据说我是王的女儿",
  }, {
    "word": "权少溺爱：娇妻带球跑",
  }, {
    "word": "神医废柴妃：鬼王，别缠我",
  }, {
    "word": "第一狂妃",
  }, {
    "word": "复仇少爷小甜妻",
  }, {
    "word": "废柴逆天召唤师",
  }, {
    "word": "小妻吻上瘾",
  }, {
    "word": "完美至尊",
  }, {
    "word": "千亿盛宠：闪婚老公超能干",
  }, {
    "word": "一纸成婚：顾少宠妻成瘾",
  }, {
    "word": "凌霄之上",
  }, {
    "word": "仙帝归来",
  }, {
    "word": "一品嫡女",
  }, {
    "word": "重生八零：军嫂有点辣",
  }, {
    "word": "傲娇鬼王爱上我",
  }, {
    "word": "我的绝色总裁未婚妻",
  }, {
    "word": "天赋武神",
  }, {
    "word": "霸道老公放肆爱",
  }, {
    "word": "闪婚蜜爱：慕少的心尖萌妻",
  }, {
    "word": "绝品败家系统",
  }, {
    "word": "少帅你老婆又跑了",
  }],
  "ok": true
}

// 搜索数据
export const SEARCH_BOOKS = {
  "books": [{
    "title": "剑来",
    "author": "烽火戏诸侯",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F2014980%2F2014980_4886fb1ed53f453a9a76005611a3310a.jpg%2F",
    "retentionRatio": 44.19,
    "latelyFollower": 72630,
  }, {
    "_id": "59e6eede81ff050a456f0521",
    "title": "剑神归来",
    "author": "龙猫跳",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F2160159%2F2160159_23b74dc560244fc0bbe1743e286b3818.jpg%2F",
    "retentionRatio": 33.38,
    "latelyFollower": 2028,
  }, {
    "_id": "5ab31e6a35addd42afac27d1",
    "title": "都市之神级学习系统",
    "author": "剑来",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F2254908%2F2254908_77fbd559bd5145bb95b5ca4912ac6184.jpg%2F",
    "retentionRatio": 30.69,
    "latelyFollower": 1248,
  }, {
    "_id": "5b2233651292f141536a19ee",
    "title": "剑从洪荒来",
    "author": "灌汤包",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F2419149%2F2419149_c85fce4428184ad0a01ff017bd400da7.jpg%2F",
    "retentionRatio": 54.84,
    "latelyFollower": 6752,
  }, {
    "_id": "592854ee666ca5f059ca86de",
    "title": "大圣直播间",
    "author": "剑西来",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F2044477%2F2044477_b61cfd34f0104db3ad894b90d1ee5f85.jpg%2F",
    "retentionRatio": 32.72,
    "latelyFollower": 737,
  }, {
    "_id": "57be3d9f4158142711e4346c",
    "title": "牛笔",
    "author": "剑西来",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F1188310%2F1188310_bb8f5851507f47d4b8a78bdf79bcd86d.jpg%2F",
    "retentionRatio": 31.53,
    "latelyFollower": 619,
  }],
  "total": 41,
  "ok": true
}

// 书籍详情
export const BOOK_DETAILS = {
  "_id": "23333",
  "title": "剑来",
  "author": "烽火戏诸侯",
  "longIntro": "大千世界，无奇不有。 我陈平安，唯有一剑，可搬山，倒海，降妖，镇魔，敕神，摘星，断江，摧城，开天！",
  "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F2014980%2F2014980_4886fb1ed53f453a9a76005611a3310a.jpg%2F",
  "latelyFollower": 72442,
  "lastChapter": "第二百三十五章 故乡黄花黄",
  "wordCount": 2062239,
  "serializeWordCount": 1960,
  "retentionRatio": "44.19",
  "updated": "2018-07-19T15:56:02.581Z",
}

// 猜你喜欢
export const BOOK_LIKES = {
  "books": [{
    "_id": "23333",
    "title": "桃花",
    "author": "烽火戏诸侯",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F73296%2F_73296_715179.jpg%2F",
  }, {
    "_id": "233333",
    "title": "步剑庭",
    "author": "意缥缈",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F873583%2F873583_b34e731fa0c5425787f0ff78e6f0bf47.jpg%2F",
  }, {
    "_id": "233332",
    "title": "死人经",
    "author": "冰临神下",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F58789%2F58789_60bf88d81078454ca3ca6910ff21398c.jpg%2F",
  }, {
    "_id": "233335",
    "title": "道缘浮图",
    "author": "烟雨江南",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F2254210%2F2254210_ce540420c39d4b15bfd6d9b3918e752d.jpg%2F",
  }, {
    "_id": "233337",
    "title": "天神下凡",
    "author": "烽火戏诸侯",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F683042%2F683042_ae5be6fe82a94d338633973e11389ea0.jpg%2F",
  }, {
    "_id": "233339",
    "title": "书剑长安",
    "author": "他曾是少年",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F1186581%2F1186581_d6aba9379ae54844a3a3b6541e7eec95.jpg%2F",
  }, {
    "_id": "2333300",
    "title": "剑叩天门",
    "author": "无头D",
    "cover": "/agent/http%3A%2F%2Fimg.1391.com%2Fapi%2Fv1%2Fbookcenter%2Fcover%2F1%2F1287301%2F1287301_894ae390f95d4a2d922fdfbc8b6d934b.jpg%2F",
  }],
  "ok": true
}

// 书源
export const BOOK_SOURCE_LIST = [{
  "_id": "23334",
  "name": "书源1",
  "lastChapter": "第五卷 道观道 第三百四十章 下笔有神",
  "updated": "2018-07-20T15:56:02.581Z",
}, {
  "_id": "23334",
  "lastChapter": "第三百四十章 下笔有神",
  "name": "书源16",
  "updated": "2018-07-20T16:02:40.424Z",
}, {
  "_id": "23334",
  "lastChapter": "第五卷 道观道 第三百四十章 下笔有神",
  "name": "书源15",
  "updated": "2018-07-20T15:55:42.962Z",
}, {
  "_id": "23334",
  "lastChapter": "第二百三十五章 故乡黄花黄",
  "name": "书源14",
  "updated": "2018-02-24T23:16:37.385Z",
}, {
  "_id": "23334",
  "lastChapter": "第二百章 死局之死结所在",
  "name": "书源13",
  "updated": "2018-01-11T16:02:42.373Z",
}, {
  "_id": "23334",
  "lastChapter": "章第八十九章 两颗人头",
  "name": "书源12",
  "updated": "2017-09-07T12:52:57.274Z",
}]

// 章节目录
export const BOOK_CHAPTER_LIST = {
  "_id": "2333",
  "book": "1111",
  "chapters": [{
    "title": "第1章   惊蛰",
  }, {
    "title": "第2章   开门",
  }, {
    "title": "第3章   日出",
  }, {
    "title": "第4章   黄鸟",
  }, {
    "title": "第5章   道破",
  }, {
    "title": "第6章   下签",
  }, {
    "title": "第7章   碗水",
  }, {
    "title": "第8章   稗草",
  }, {
    "title": "第9章   天雨虽宽",
  }],
  "updated": "2018-07-20T15:56:02.581Z",
}

// 查章节详情
export const BOOK_CHAPTER_DETAILS = {
  "ok": true,
  "chapter": {
    "title": "正文 第一章 惊蛰",
    "cpContent": "\n\n二月二，龙抬头。\n\n暮色里，小镇名叫泥瓶巷的僻静地方，有位孤苦伶仃的清瘦少年，此时他正按照习俗，一手持蜡烛，一手持桃枝，照耀房梁、墙壁、木床等处，用桃枝敲敲打打，试图借此驱赶蛇蝎、蜈蚣等，嘴里念念有词，是这座小镇祖祖辈辈传下来的老话：二月二，烛照梁，桃打墙，人间蛇虫无处藏。\n\n少年姓陈，名平安，爹娘早逝。小镇的瓷器极负盛名，本朝开国以来，就担当起“奉诏监烧献陵祭器”的重任，有朝廷官员常年驻扎此地，监理官窑事务。无依无靠的少年，很早就当起了烧瓷的窑匠，起先只能做些杂事粗活，跟着一个脾气糟糕的半路师傅，辛苦熬了几年，刚刚琢磨到一点烧瓷的门道，结果世事无常，小镇突然失去了官窑造办这张护身符，小镇周边数十座形若卧龙的窑炉，一夜之间全部被官府勒令关闭熄火。\n\n陈平安放下新折的那根桃枝，吹灭蜡烛，走出屋子后，坐在台阶上，仰头望去，星空璀璨。\n\n少年至今仍然清晰记得，那个只肯认自己做半个徒弟的老师傅，姓姚，在去年暮秋时分的清晨，被人发现坐在一张小竹椅子上，正对着窑头方向，闭眼了。\n\n不过如姚老头这般钻牛角尖的人，终究少数。\n\n世世代代都只会烧瓷一事的小镇匠人，既不敢僭越烧制贡品官窑，也不敢将库藏瓷器私自贩卖给百姓，只得纷纷另谋出路，十四岁的陈平安也被扫地出门，回到泥瓶巷后，继续守着这栋早已破败不堪的老宅，差不多是家徒四壁的惨淡场景，便是陈平安想要当败家子，也无从下手。\n\n当了一段时间飘来荡去的孤魂野鬼，少年实在找不到挣钱的营生，靠着那点微薄积蓄，少年勉强填饱肚子，前几天听说几条街外的骑龙巷，来了个姓阮的外乡老铁匠，对外宣称要收七八个打铁的学徒，不给工钱，但管饭，陈平安就赶紧跑去碰运气，不曾想老人只是斜瞥了他一眼，就把他拒之门外，当时陈平安就纳闷，难道打铁这门活计，不是看臂力大小，而是看面相好坏？\n\n要知道陈平安虽然看着孱弱，但力气不容小觑，这是少年那些年烧瓷拉坯锻炼出来的身体底子，除此之外，陈平安还跟着姓姚的老人，跑遍了小镇方圆百里的山山水水，尝遍了四周各种土壤的滋味，任劳任怨，什么脏活累活都愿意做，毫不拖泥带水。可惜老姚始终不喜欢陈平安，嫌弃少年没有悟性，是榆木疙瘩不开窍，远远不如大徒弟刘羡阳，这也怪不得老人偏心，师父领进门，修行在个人，例如同样是枯燥乏味的拉坯，刘羡阳短短半年的功力，就抵得上陈平安辛苦三年的水准。\n\n虽然这辈子都未必用得着这门手艺，但陈平安仍是像以往一般，闭上眼睛，想象自己身前搁置有青石板和轱辘车，开始练习拉坯，熟能生巧。\n\n大概每过一刻钟，少年就会歇息稍许时分，抖抖手腕，如此循环反复，直到整个人彻底精疲力尽，陈平安这才起身，一边在院中散步，一边缓缓舒展筋骨。从来没有人教过陈平安这些，是他自己瞎琢磨出来的门道。\n\n天地间原本万籁寂静，陈平安听到一声刺耳的讥讽笑声，停下脚步，果不其然，看到那个同龄人蹲在墙头上，咧着嘴，毫不掩饰他的鄙夷神色。\n\n此人是陈平安的老邻居，据说更是前任监造大人的私生子，那位大人唯恐清流非议、言官弹劾，最后孤身返回京城述职，把孩子交由颇有私交情谊的接任官员，帮着看管照拂。如今小镇莫名其妙地失去官窑烧制资格，负责替朝廷监理窑务的督造大人，自己都泥菩萨过江自身难保了，哪里还顾得上官场同僚的私生子，丢下一些银钱，就火急火燎赶往京城打点关系。\n\n不知不觉已经沦为弃子的邻居少年，日子倒是依旧过得优哉游哉，成天带着他的贴身丫鬟，在小镇内外逛荡，一年到头游手好闲，也从来不曾为银子发过愁。\n\n泥瓶巷家家户户的黄土院墙都很低矮，其实邻居少年完全不用踮起脚跟，就可以看到这边院子的景象，可每次跟陈平安说话，偏偏喜欢蹲在墙头上。\n\n相比陈平安这个名字的粗浅俗气，邻居少年就要雅致许多，叫宋集薪，就连与他相依为命的婢女，也有个文绉绉的称呼，稚圭。\n\n少女此时就站在院墙那边，她有一双杏眼，怯怯弱弱。\n\n院门那边，有个嗓音响起，“你这婢女卖不卖？”\n\n宋集薪愣了愣，循着声音转头望去，是个眉眼含笑的锦衣少年，站在院外，一张全然陌生的面孔。\n\n锦衣少年身边站着一位身材高大的老者，面容白皙，脸色和蔼，轻轻眯眼打量着两座毗邻院落的少年少女。\n\n老者的视线在陈平安一扫而过，并无停滞，但是在宋集薪和婢女身上，多有停留，笑意渐渐浓郁。\n\n宋集薪斜眼道：“卖！怎么不卖！”\n\n那少年微笑道：“那你说个价。”\n\n少女瞪大眼眸，满脸匪夷所思，像一头惊慌失措的年幼麋鹿。\n\n宋集薪翻了个白眼，伸出一根手指，晃了晃，“白银一万两！”\n\n锦衣少年脸色如常，点头道：“好。”\n\n宋集薪见那少年不像是开玩笑的样子，连忙改口道：“是黄金万两！”\n\n锦衣少年嘴角翘起，道：“逗你玩的。”\n\n宋集薪脸色阴沉。\n\n锦衣少年不再理睬宋集薪，偏移视线，望向陈平安，“今天多亏了你，我才能买到那条鲤鱼，买回去后，我越看越欢喜，想着一定要当面跟你道一声谢，于是就让吴爷爷带我连夜来找你。”\n\n他丢出一只沉甸甸的绣袋，抛给陈平安，笑脸灿烂道：“这是酬谢，你我就算两清了。”\n\n陈平安刚想要说话，锦衣少年已经转身离去。\n\n陈平安皱了皱眉头。\n\n白天自己无意间看到有个中年人，提着只鱼篓走在大街上，捕获了一尾巴掌长短的金黄鲤鱼，它在竹篓里蹦跳得厉害，陈平安只瞥了一眼，就觉得很喜庆，于是开口询问，能不能用十文钱买下它，中年人本来只是想着犒劳犒劳自己的五脏庙，眼见有利可图，就坐地起价，狮子大开口，非要三十文钱才肯卖。囊中羞涩的陈平安哪里有这么多闲钱，又实在舍不得那条金灿灿的鲤鱼，就眼馋跟着中年人，软磨硬泡，想着把价格砍到十五文，哪怕是二十文也行，就在中年人有松口迹象的时候，锦衣少年和高大老人正好路过，他们二话不说，用五十文钱买走了鲤鱼和鱼篓，陈平安只能眼睁睁看着他们扬长而去，无可奈何。\n\n死死盯住那对爷孙愈行愈远的背影，宋集薪收回恶狠狠的眼神后，跳下墙头，似乎记起什么，对陈平安说道：“你还记得正月里的那条四脚吗？”\n\n陈平安点了点头。\n\n怎么会不记得，简直就是记忆犹新。\n\n按照这座小镇传承数百年的风俗，如果有蛇类往自家屋子钻，是好兆头，主人绝对不要将其驱逐打杀。宋集薪在正月初一的时候，坐在门槛上晒太阳，然后就有只俗称四脚蛇的小玩意儿，在他的眼皮子底下往屋里窜，宋集薪一把抓住就往院子里摔出去，不曾想那条已经摔得七荤八素的四脚蛇，愈挫愈勇，一次次，把从来不信鬼神之说的宋集薪给气得不行，一怒之下就把它甩到了陈平安院子，哪里想到，宋集薪第二天就在自己床底下，看到了那条盘踞蜷缩起来的四脚蛇。\n\n宋集薪察觉到少女扯了扯自己袖子。\n\n少年与她心有灵犀，下意识就将已经到了嘴边的话语，重新咽回肚子。\n\n他想说的是，那条奇丑无比的四脚蛇，最近额头上有隆起，如头顶生角。\n\n宋集薪换了一句话说出口，“我和稚圭可能下个月就要离开这里了。”\n\n陈平安叹了口气，“路上小心。”\n\n宋集薪半真半假道：“有些物件我肯定搬不走，你可别趁我家没人，就肆无忌惮地偷东西。”\n\n陈平安摇了摇头。\n\n宋集薪蓦然哈哈大笑，用手指点了点陈平安，嬉皮笑脸道：“胆小如鼠，难怪寒门无贵子，莫说是这辈子贫贱任人欺，说不定下辈子也逃不掉。”\n\n陈平安默不作声。\n\n各自返回屋子，陈平安关上门，躺在坚硬的木板床上，贫寒少年闭上眼睛，小声呢喃道：“碎碎平，岁岁安，碎碎平安，岁岁平安……”\n\n-------------\n\nps1:雪中的一个近二十万字的番外在微信里面更新了，微信公众号是：fenghuo1985\n\nps2:还没上传就一百多位盟主，你们威武...\n\nps3:好久不见，剑来！\n\n"
  }
}

// 更新查询
export const BOOK_CASE_UPDATE = [{
  "_id": "23333",
  "author": "烽火戏诸侯",
  "allowMonthly": false,
  "referenceSource": "default",
  "updated": "2018-07-20T15:56:02.581Z",
  "chaptersCount": 341,
  "lastChapter": "第五卷 道观道 第三百四十章 下笔有神"
}]
